tests/nonHarmonic/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    Cylinder
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    Inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.04;
        value           uniform 1;
    }
    Outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    "(Front|Back|Top|Bottom)"
    {
        type            slip;
    }
}



// ************************************************************************* //
